app/Http/Controllers/Auth/AuthenticatedSessionController.php



        // Update Last Login Time
        $user->update(
            [
                'last_login_at' => Carbon::now()->toDateTimeString(),
            ]
        );
---
update `users` set `last_login_at` = '2022-05-14 00:25:02', `users`.`updated_at` = '2022-05-14 00:25:02' where `id` = 2