routes/web.php

);
Route::get(
    '/get_landing_page_section/{name}', function ($name) {
    $plans = \DB::table('plans')->get();
---
select * from `plans`