app/Http/Controllers/DashboardController.php

select * from `revenues` where `created_by` = 2 order by `id` desc limit 5
select * from `payments` where `created_by` = 2 order by `id` desc limit 5
select * from `product_service_categories` where `created_by` = 2 and `type` = 1
---
    public function account_dashboard_index()
    {
        if(Auth::check())
        {
            if(Auth::user()->type == 'super admin')
            {
                return redirect()->route('client.dashboard.view');
            }
            elseif(Auth::user()->type == 'client')
            {
                return redirect()->route('client.dashboard.view');
            }
            else
            {
                if(\Auth::user()->can('show account dashboard'))
                {
                    $data['latestIncome']  = Revenue::where('created_by', '=', \Auth::user()->creatorId())->orderBy('id', 'desc')->limit(5)->get();
                    $data['latestExpense'] = Payment::where('created_by', '=', \Auth::user()->creatorId())->orderBy('id', 'desc')->limit(5)->get();


                    $incomeCategory = ProductServiceCategory::where('created_by', '=', \Auth::user()->creatorId())->where('type', '=', 1)->get();

select * from `product_service_categories` where `created_by` = 2 and `type` = 2
---
                    $data['incomeCatAmount']     = $inAmount;


                    $expenseCategory = ProductServiceCategory::where('created_by', '=', \Auth::user()->creatorId())->where('type', '=', 2)->get();

select count(*) as aggregate from `taxes` where `created_by` = 2
select count(*) as aggregate from `product_service_categories` where `created_by` = 2
select count(*) as aggregate from `product_service_units` where `created_by` = 2
select count(*) as aggregate from `bank_accounts` where `created_by` = 2
select * from `bank_accounts` where `created_by` = 2
select * from `invoices` where `created_by` = 2 order by `id` desc limit 5
select * from `bills` where `created_by` = 2 order by `id` desc limit 5
select * from `goals` where `created_by` = 2 and `is_display` = 1
---
                    $data['currentYear']  = date('Y');
                    $data['currentMonth'] = date('M');

                    $constant['taxes']         = Tax::where('created_by', \Auth::user()->creatorId())->count();
                    $constant['category']      = ProductServiceCategory::where('created_by', \Auth::user()->creatorId())->count();
                    $constant['units']         = ProductServiceUnit::where('created_by', \Auth::user()->creatorId())->count();
                    $constant['bankAccount']   = BankAccount::where('created_by', \Auth::user()->creatorId())->count();
                    $data['constant']          = $constant;
                    $data['bankAccountDetail'] = BankAccount::where('created_by', '=', \Auth::user()->creatorId())->get();
                    $data['recentInvoice']     = Invoice::where('created_by', '=', \Auth::user()->creatorId())->orderBy('id', 'desc')->limit(5)->get();
                    $data['weeklyInvoice']     = \Auth::user()->weeklyInvoice();
                    $data['monthlyInvoice']    = \Auth::user()->monthlyInvoice();
                    $data['recentBill']        = Bill::where('created_by', '=', \Auth::user()->creatorId())->orderBy('id', 'desc')->limit(5)->get();
                    $data['weeklyBill']        = \Auth::user()->weeklyBill();
                    $data['monthlyBill']       = \Auth::user()->monthlyBill();
                    $data['goals']             = Goal::where('created_by', '=', \Auth::user()->creatorId())->where('is_display', 1)->get();

select * from `plans`
select * from `landing_page_sections` order by `section_order` asc
---
                $settings = Utility::settings();
                if($settings['display_landing_page'] == 'on')
                {
                    $plans       = Plan::get();
                    $get_section = LandingPageSection::orderBy('section_order', 'ASC')->get();