app/Http/Controllers/DealController.php

    public function index()
    {
        $usr      = \Auth::user();
        $pipeline = Pipeline::where('created_by', '=', $usr->ownerId())->where('id', '=', $usr->default_pipeline)->first();

        if($usr->can('manage deal'))
        {
            if($usr->default_pipeline)
            {
                $pipeline = Pipeline::where('created_by', '=', $usr->ownerId())->where('id', '=', $usr->default_pipeline)->first();
                if(!$pipeline)
                {
                    $pipeline = Pipeline::where('created_by', '=', $usr->ownerId())->first();
                }
            }
            else
            {
                $pipeline = Pipeline::where('created_by', '=', $usr->ownerId())->first();
---
select * from `pipelines` where `created_by` = 2 and `id` = 1 limit 1
select * from `pipelines` where `created_by` = 2

                $id_deals = $usr->deals->pluck('id');
            }

            $deals       = Deal::whereIn('id', $id_deals)->where('pipeline_id', '=', $pipeline->id)->get();
            $curr_month  = Deal::whereIn('id', $id_deals)->where('pipeline_id', '=', $pipeline->id)->whereMonth('created_at', '=', date('m'))->get();
            $curr_week   = Deal::whereIn('id', $id_deals)->where('pipeline_id', '=', $pipeline->id)->whereBetween(
                'created_at', [
                                \Carbon\Carbon::now()->startOfWeek(),
                                \Carbon\Carbon::now()->endOfWeek(),
                            ]
            )->get();
            $last_30days = Deal::whereIn('id', $id_deals)->where('pipeline_id', '=', $pipeline->id)->whereDate('created_at', '>', \Carbon\Carbon::now()->subDays(30))->get();
---
select * from `deals` where `id` in (1) and `pipeline_id` = 1
select * from `deals` where `id` in (1) and `pipeline_id` = 1 and month(`created_at`) = '05'
select * from `deals` where `id` in (1) and `pipeline_id` = 1 and `created_at` between '2022-05-09 00:00:00' and '2022-05-15 23:59:59'
select * from `deals` where `id` in (1) and `pipeline_id` = 1 and date(`created_at`) > '2022-04-14'

    public function deal_list()
    {
        $usr = \Auth::user();
        if($usr->can('manage deal'))
        {
            if($usr->default_pipeline)
            {
                $pipeline = Pipeline::where('created_by', '=', $usr->ownerId())->where('id', '=', $usr->default_pipeline)->first();
                if(!$pipeline)
                {
                    $pipeline = Pipeline::where('created_by', '=', $usr->ownerId())->first();
                }
            }
            else
            {
                $pipeline = Pipeline::where('created_by', '=', $usr->ownerId())->first();
            }

            $pipelines = Pipeline::where('created_by', '=', $usr->ownerId())->get()->pluck('name', 'id');

            if($usr->type == 'client')
            {
                $id_deals = $usr->clientDeals->pluck('id');
            }
            else
            {
                $id_deals = $usr->deals->pluck('id');
            }

            $deals       = Deal::whereIn('id', $id_deals)->where('pipeline_id', '=', $pipeline->id)->get();
            $curr_month  = Deal::whereIn('id', $id_deals)->where('pipeline_id', '=', $pipeline->id)->whereMonth('created_at', '=', date('m'))->get();
            $curr_week   = Deal::whereIn('id', $id_deals)->where('pipeline_id', '=', $pipeline->id)->whereBetween(
                'created_at', [
                                \Carbon\Carbon::now()->startOfWeek(),
                                \Carbon\Carbon::now()->endOfWeek(),
                            ]
            )->get();
            $last_30days = Deal::whereIn('id', $id_deals)->where('pipeline_id', '=', $pipeline->id)->whereDate('created_at', '>', \Carbon\Carbon::now()->subDays(30))->get();
---
select * from `pipelines` where `created_by` = 2 and `id` = 1 limit 1
select * from `pipelines` where `created_by` = 2
select * from `deals` where 0 = 1 and `pipeline_id` = 1
select * from `deals` where 0 = 1 and `pipeline_id` = 1 and month(`created_at`) = '05'
select * from `deals` where 0 = 1 and `pipeline_id` = 1 and `created_at` between '2022-05-09 00:00:00' and '2022-05-15 23:59:59'
select * from `deals` where 0 = 1 and `pipeline_id` = 1 and date(`created_at`) > '2022-04-14'

            }
            else
            {
                $deals = Deal::select('deals.*')->join('user_deals', 'user_deals.deal_id', '=', 'deals.id')->where('user_deals.user_id', '=', $usr->id)->where('deals.pipeline_id', '=', $pipeline->id)->orderBy('deals.order')->get();
---
select `deals`.* from `deals` inner join `user_deals` on `user_deals`.`deal_id` = `deals`.`id` where `user_deals`.`user_id` = 2 and `deals`.`pipeline_id` = 1 order by `deals`.`order` asc

    public function create()
    {
        if(\Auth::user()->can('create deal'))
        {
            $clients      = User::where('created_by', '=', \Auth::user()->ownerId())->where('type', 'client')->get()->pluck('name', 'id');
            $customFields = CustomField::where('module', '=', 'deal')->get();
---
select * from `custom_fields` where `module` = 'deal'

    public function store(Request $request)
    {
        $usr = \Auth::user();
        if($usr->can('create deal'))
        {
            $countDeal = Deal::where('created_by', '=', $usr->ownerId())->count();
            $validator = \Validator::make(
                $request->all(), [
                                   'name' => 'required',
                               ]
            );

            if($validator->fails())
            {
                $messages = $validator->getMessageBag();

                return redirect()->back()->with('error', $messages->first());
            }

            // Default Field Value
            if($usr->default_pipeline)
            {
                $pipeline = Pipeline::where('created_by', '=', $usr->ownerId())->where('id', '=', $usr->default_pipeline)->first();
---
select count(*) as aggregate from `deals` where `created_by` = 2
select * from `pipelines` where `created_by` = 2 and `id` = 1 limit 1

                $pipeline = Pipeline::where('created_by', '=', $usr->ownerId())->first();
            }

            $stage = Stage::where('pipeline_id', '=', $pipeline->id)->first();
---
select * from `stages` where `pipeline_id` = 1 limit 1

                $deal->stage_id    = $stage->id;
                $deal->status      = 'Active';
                $deal->created_by  = $usr->ownerId();
                $deal->save();
---
insert into `deals` (`name`, `phone`, `price`, `pipeline_id`, `stage_id`, `status`, `created_by`, `updated_at`, `created_at`) values ('Test', '0662718225', '123', 1, 1, 'Active', 2, '2022-05-14 01:02:05', '2022-05-14 01:02:05')


                foreach(array_keys($clients) as $client)
                {
                    ClientDeal::create(
                        [
                            'deal_id' => $deal->id,
                            'client_id' => $client,
                        ]
                    );
                }


                UserDeal::create(
                    [
                        'user_id' => $usr->id,
                        'deal_id' => $deal->id,
                    ]
                );
---
insert into `client_deals` (`deal_id`, `client_id`, `updated_at`, `created_at`) values (1, 4, '2022-05-14 01:02:12', '2022-05-14 01:02:12')
insert into `user_deals` (`user_id`, `deal_id`, `updated_at`, `created_at`) values (2, 1, '2022-05-14 01:02:12', '2022-05-14 01:02:12')

    public function edit(Deal $deal)
    {
        if(\Auth::user()->can('edit deal'))
        {
            if($deal->created_by == \Auth::user()->ownerId())
            {
                $pipelines         = Pipeline::where('created_by', '=', \Auth::user()->ownerId())->get()->pluck('name', 'id');
                $sources           = Source::where('created_by', '=', \Auth::user()->ownerId())->get()->pluck('name', 'id');
                $products          = ProductService::where('created_by', '=', \Auth::user()->ownerId())->get()->pluck('name', 'id');
                $deal->customField = CustomField::getData($deal, 'deal');
                $customFields      = CustomField::where('module', '=', 'deal')->get();
---
select * from `custom_fields` where `module` = 'deal'

    public function labels($id)
    {
        if(\Auth::user()->can('edit deal'))
        {
            $deal = Deal::find($id);
            if($deal->created_by == \Auth::user()->ownerId())
            {
                $labels   = Label::where('pipeline_id', '=', $deal->pipeline_id)->where('created_by', \Auth::user()->creatorId())->get();
---
select * from `deals` where `deals`.`id` = '1' limit 1
select * from `labels` where `pipeline_id` = 1 and `created_by` = 2