app/Http/Controllers/LandingPageSectionController.php

    public function show(Request $request, $id)
    {

        $section_name = $request->section_name;
        $section_type = $request->section_type;


        $get_content = LandingPageSection::where(['id' => $id])->first();
---
select * from `landing_page_sections` where (`id` = '8') limit 1