app/Http/Controllers/UserController.php

    public function profile()
    {
        $userDetail              = \Auth::user();
        $userDetail->customField = CustomField::getData($userDetail, 'user');
        $customFields            = CustomField::where('created_by', '=', \Auth::user()->creatorId())->where('module', '=', 'user')->get();
---
select * from `custom_fields` where `created_by` = 2 and `module` = 'user'